**Introduction to Pandas**

In [ ]:
import pandas as pd

In [ ]:
# creating a DataFrame

pd.DataFrame({'names':["Gumbal","Drawin","Anais"],'Age':[10,12,18]})

    names  Age
0  Gumbal   10
1  Drawin   12
2   Anais   18

In [ ]:
# creating a Series

pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [ ]:
sales = pd.Series([30,12,55],index=['day 1','day 2','day 3'],name='Product A')

In [ ]:

sales

day 1    30
day 2    12
day 3    55
Name: Product A, dtype: int64

In [ ]:
sales.to_frame()   #to_frame method used to convert a series into DataFrame

       Product A
day 1         30
day 2         12
day 3         55

In [ ]:
data = pd.read_csv('/content/drive/MyDrive/titanic_train.csv')
data

,passenger_id,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,survived
0,1216,3,"Smyth, Miss. Julia",female,NaN,0,0,335432,7.7333,NaN,Q,13,NaN,NaN,1
1,699,3,"Cacic, Mr. Luka",male,38.0,0,0,315089,8.6625,NaN,S,NaN,NaN,Croatia,0
2,1267,3,"Van Impe, Mrs. Jean Baptiste (Rosalie Paula Go...",female,30.0,1,1,345773,24.1500,NaN,S,NaN,NaN,NaN,0
3,449,2,"Hocking, Mrs. Elizabeth (Eliza Needs)",female,54.0,1,3,29105,23.0000,NaN,S,4,NaN,"Cornwall / Akron, OH",1
4,576,2,"Veal, Mr. James",male,40.0,0,0,28221,13.0000,NaN,S,NaN,NaN,"Barre, Co Washington, VT",0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
845,158,1,"Hipkins, Mr. William Edward",male,55.0,0,0,680,50.0000,C39,S,NaN,NaN,London / Birmingham,0
846,174,1,"Kent, Mr. Edward Austin",male,58.0,0,0,11771,29.7000,B37,C,NaN,258.0,"Buffalo, NY",0
847,467,2,"Kantor, Mrs. Sinai (Miriam Sternin)",female,24.0,1,0,244367,26.0000,NaN,S,12,NaN,"Moscow / Bronx, NY",1
848,1112,3,"Peacock, Miss. Treasteall",female,3.0,1,1,SOTON/O.Q. 3101315,13.7750,NaN,S,NaN,NaN,NaN,0
849,425,2,"Greenberg, Mr. Samuel",male,52.0,0,0,250647,13.0000,NaN,S,NaN,19.0,"Bronx, NY",0

In [ ]:
# print the shape of data

print(data.shape)

(850, 15)

In [ ]:
#  print the first five rows of data

print(data.head())

   passenger_id  pclass                                               name  \
0          1216       3                                 Smyth, Miss. Julia
1           699       3                                    Cacic, Mr. Luka
2          1267       3  Van Impe, Mrs. Jean Baptiste (Rosalie Paula Go...
3           449       2              Hocking, Mrs. Elizabeth (Eliza Needs)
4           576       2                                    Veal, Mr. James

      sex   age  sibsp  parch  ticket     fare cabin embarked boat  body  \
0  female   NaN      0      0  335432   7.7333   NaN        Q   13   NaN
1    male  38.0      0      0  315089   8.6625   NaN        S  NaN   NaN
2  female  30.0      1      1  345773  24.1500   NaN        S  NaN   NaN
3  female  54.0      1      3   29105  23.0000   NaN        S    4   NaN
4    male  40.0      0      0   28221  13.0000   NaN        S  NaN   NaN

                  home.dest  survived
0                       NaN         1
1                   Croatia         0
2                       NaN         0
3      Cornwall / Akron, OH         1
4  Barre, Co Washington, VT         0

In [ ]:
# for detailed information about each and individual column

print(data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 850 entries, 0 to 849
Data columns (total 15 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   passenger_id  850 non-null    int64
 1   pclass        850 non-null    int64
 2   name          850 non-null    object
 3   sex           850 non-null    object
 4   age           676 non-null    float64
 5   sibsp         850 non-null    int64
 6   parch         850 non-null    int64
 7   ticket        850 non-null    object
 8   fare          849 non-null    float64
 9   cabin         191 non-null    object
 10  embarked      849 non-null    object
 11  boat          308 non-null    object
 12  body          73 non-null     float64
 13  home.dest     464 non-null    object
 14  survived      850 non-null    int64
dtypes: float64(3), int64(5), object(7)
memory usage: 99.7+ KB
None

In [ ]:
# print the description of data like count,mean,std ,quartile, max and min

print(data.describe())

       passenger_id     pclass         age       sibsp       parch  \
count    850.000000  850.00000  676.000000  850.000000  850.000000
mean     662.816471    2.32000   29.519847    0.522353    0.382353
std      380.751936    0.83853   14.562243    1.112132    0.879511
min        1.000000    1.00000    0.166700    0.000000    0.000000
25%      332.250000    2.00000   20.000000    0.000000    0.000000
50%      676.500000    3.00000   28.000000    0.000000    0.000000
75%      992.250000    3.00000   37.000000    1.000000    0.000000
max     1307.000000    3.00000   80.000000    8.000000    9.000000

             fare        body    survived
count  849.000000   73.000000  850.000000
mean    34.012701  165.821918    0.368235
std     53.705779   99.068487    0.482610
min      0.000000    4.000000    0.000000
25%      7.895800   75.000000    0.000000
50%     14.108300  166.000000    0.000000
75%     31.000000  260.000000    1.000000
max    512.329200  328.000000    1.000000

**Some Basic Methods**

In [ ]:
# print top few rows

print(data.head(10))

   passenger_id  pclass                                               name  \
0          1216       3                                 Smyth, Miss. Julia
1           699       3                                    Cacic, Mr. Luka
2          1267       3  Van Impe, Mrs. Jean Baptiste (Rosalie Paula Go...
3           449       2              Hocking, Mrs. Elizabeth (Eliza Needs)
4           576       2                                    Veal, Mr. James
5          1083       3                           Olsen, Mr. Henry Margido
6           898       3                    Johnson, Mr. William Cahoone Jr
7           560       2                              Sinkkonen, Miss. Anna
8          1079       3                                 Ohman, Miss. Velin
9           908       3                           Jussila, Miss. Mari Aina

      sex   age  sibsp  parch  ticket     fare cabin embarked boat   body  \
0  female   NaN      0      0  335432   7.7333   NaN        Q   13    NaN
1    male  38.0      0      0  315089   8.6625   NaN        S  NaN    NaN
2  female  30.0      1      1  345773  24.1500   NaN        S  NaN    NaN
3  female  54.0      1      3   29105  23.0000   NaN        S    4    NaN
4    male  40.0      0      0   28221  13.0000   NaN        S  NaN    NaN
5    male  28.0      0      0  C 4001  22.5250   NaN        S  NaN  173.0
6    male  19.0      0      0    LINE   0.0000   NaN        S  NaN    NaN
7  female  30.0      0      0  250648  13.0000   NaN        S   10    NaN
8  female  22.0      0      0  347085   7.7750   NaN        S    C    NaN
9  female  21.0      1      0    4137   9.8250   NaN        S  NaN    NaN

                  home.dest  survived
0                       NaN         1
1                   Croatia         0
2                       NaN         0
3      Cornwall / Akron, OH         1
4  Barre, Co Washington, VT         0
5                       NaN         0
6                       NaN         0
7  Finland / Washington, DC         1
8                       NaN         1
9                       NaN         0

In [ ]:
# print bottom 5 rows
print(data.tail())

     passenger_id  pclass                                 name     sex   age  \
845           158       1          Hipkins, Mr. William Edward    male  55.0
846           174       1              Kent, Mr. Edward Austin    male  58.0
847           467       2  Kantor, Mrs. Sinai (Miriam Sternin)  female  24.0
848          1112       3            Peacock, Miss. Treasteall  female   3.0
849           425       2                Greenberg, Mr. Samuel    male  52.0

     sibsp  parch              ticket    fare cabin embarked boat   body  \
845      0      0                 680  50.000   C39        S  NaN    NaN
846      0      0               11771  29.700   B37        C  NaN  258.0
847      1      0              244367  26.000   NaN        S   12    NaN
848      1      1  SOTON/O.Q. 3101315  13.775   NaN        S  NaN    NaN
849      0      0              250647  13.000   NaN        S  NaN   19.0

               home.dest  survived
845  London / Birmingham         0
846          Buffalo, NY         0
847   Moscow / Bronx, NY         1
848                  NaN         0
849            Bronx, NY         0

In [ ]:
print(data.values)     #values command fetches and display individual rows

[[1216 3 'Smyth, Miss. Julia' ... nan nan 1]
 [699 3 'Cacic, Mr. Luka' ... nan 'Croatia' 0]
 [1267 3 'Van Impe, Mrs. Jean Baptiste (Rosalie Paula Govaert)' ... nan
  nan 0]
 ...
 [467 2 'Kantor, Mrs. Sinai (Miriam Sternin)' ... nan
  'Moscow / Bronx, NY' 1]
 [1112 3 'Peacock, Miss. Treasteall' ... nan nan 0]
 [425 2 'Greenberg, Mr. Samuel' ... 19.0 'Bronx, NY' 0]]

In [ ]:
# to see the list of unique values and how often they occur in dataset
print(data.age.value_counts())

18.0000    32
30.0000    30
24.0000    29
22.0000    28
25.0000    26
           ..
80.0000     1
0.4167      1
22.5000     1
40.5000     1
76.0000     1
Name: age, Length: 88, dtype: int64

In [ ]:
# count the number of each gender
print(data.sex.value_counts())  

gender_per = data.sex.value_counts(normalize=True)      #in percentage form
print(gender_per)

# count the number of each class and unsort
unsorted = data.pclass.value_counts(sort=False)
print(unsorted)     


# get the percentage of each class in  sorted 
gender_sorted = data.pclass.value_counts(sort=True , normalize=True)
print(gender_sorted)

male      551
female    299
Name: sex, dtype: int64
male      0.648235
female    0.351765
Name: sex, dtype: float64
3    478
2    166
1    206
Name: pclass, dtype: int64
3    0.562353
1    0.242353
2    0.195294
Name: pclass, dtype: float64

In [ ]:
# print the column index of Data

print(data.columns)

Index(['passenger_id', 'pclass', 'name', 'sex', 'age', 'sibsp', 'parch',
       'ticket', 'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest',
       'survived'],
      dtype='object')

In [ ]:
# print row index
print(data.index)

RangeIndex(start=0, stop=850, step=1)

In [ ]:
# sort individual columns
data.sort_values('fare',ascending=False)

,passenger_id,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,survived
790,183,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C,3,NaN,NaN,1
796,49,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C,3,NaN,"Austria-Hungary / Germantown, Philadelphia, PA",1
60,50,1,"Cardeza, Mrs. James Warburton Martinez (Charlo...",female,58.0,0,1,PC 17755,512.3292,B51 B53 B55,C,3,NaN,"Germantown, Philadelphia, PA",1
247,115,1,"Fortune, Mr. Mark",male,64.0,1,4,19950,263.0000,C23 C25 C27,S,NaN,NaN,"Winnipeg, MB",0
714,116,1,"Fortune, Mrs. Mark (Mary McDougald)",female,60.0,1,4,19950,263.0000,C23 C25 C27,S,10,NaN,"Winnipeg, MB",1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
506,125,1,"Fry, Mr. Richard",male,NaN,0,0,112058,0.0000,B102,S,NaN,NaN,NaN,0
95,150,1,"Harrison, Mr. William",male,40.0,0,0,112059,0.0000,B94,S,NaN,110.0,NaN,0
6,898,3,"Johnson, Mr. William Cahoone Jr",male,19.0,0,0,LINE,0.0000,NaN,S,NaN,NaN,NaN,0
346,234,1,"Reuchlin, Jonkheer. John George",male,38.0,0,0,19972,0.0000,NaN,S,NaN,NaN,"Rotterdam, Netherlands",0
416,1225,3,"Storey, Mr. Thomas",male,60.5,0,0,3701,NaN,NaN,S,NaN,261.0,NaN,0

In [ ]:
# to sort two columns we use the list

sorted = data.sort_values(['pclass','fare'], ascending=False)
print(sorted.head(15))

     passenger_id  pclass                               name     sex   age  \
47           1179       3              Sage, Mr. John George    male   NaN
79           1178       3           Sage, Mr. George John Jr    male   NaN
133          1180       3     Sage, Mrs. John (Annie Bullen)  female   NaN
167          1177       3                Sage, Mr. Frederick    male   NaN
329          1175       3            Sage, Miss. Stella Anna  female   NaN
430          1171       3        Sage, Master. William Henry    male  14.5
549          1172       3                    Sage, Miss. Ada  female   NaN
556          1173       3       Sage, Miss. Constance Gladys  female   NaN
567          1174       3  Sage, Miss. Dorothy Edith "Dolly"  female   NaN
720          1176       3           Sage, Mr. Douglas Bullen    male   NaN
176           949       3                     Lang, Mr. Fang    male  26.0
233           946       3                       Lam, Mr. Len    male   NaN
337           805       3                    Foo, Mr. Choong    male   NaN
435           972       3                      Ling, Mr. Lee    male  28.0
508           714       3                    Chip, Mr. Chang    male  32.0

     sibsp  parch    ticket     fare cabin embarked boat  body  \
47       1      9  CA. 2343  69.5500   NaN        S  NaN   NaN
79       8      2  CA. 2343  69.5500   NaN        S  NaN   NaN
133      1      9  CA. 2343  69.5500   NaN        S  NaN   NaN
167      8      2  CA. 2343  69.5500   NaN        S  NaN   NaN
329      8      2  CA. 2343  69.5500   NaN        S  NaN   NaN
430      8      2  CA. 2343  69.5500   NaN        S  NaN  67.0
549      8      2  CA. 2343  69.5500   NaN        S  NaN   NaN
556      8      2  CA. 2343  69.5500   NaN        S  NaN   NaN
567      8      2  CA. 2343  69.5500   NaN        S  NaN   NaN
720      8      2  CA. 2343  69.5500   NaN        S  NaN   NaN
176      0      0      1601  56.4958   NaN        S   14   NaN
233      0      0      1601  56.4958   NaN        S  NaN   NaN
337      0      0      1601  56.4958   NaN        S   13   NaN
435      0      0      1601  56.4958   NaN        S  NaN   NaN
508      0      0      1601  56.4958   NaN        S    C   NaN

                  home.dest  survived
47                      NaN         0
79                      NaN         0
133                     NaN         0
167                     NaN         0
329                     NaN         0
430                     NaN         0
549                     NaN         0
556                     NaN         0
567                     NaN         0
720                     NaN         0
176                     NaN         1
233                     NaN         0
337  Hong Kong New York, NY         1
435                     NaN         0
508  Hong Kong New York, NY         1

**Subsetting Columns**

In [ ]:
data['fare']

0       7.7333
1       8.6625
2      24.1500
3      23.0000
4      13.0000
        ...
845    50.0000
846    29.7000
847    26.0000
848    13.7750
849    13.0000
Name: fare, Length: 850, dtype: float64

In [ ]:
# Select the fare and survived columns
data_com = data[['fare','survived']]  #for multiple columns use list
print(data_com.head(3))

      fare  survived
0   7.7333         1
1   8.6625         0
2  24.1500         0

In [ ]:
# filter for rows where fare is greater than 70

print(data['fare'] > 70)

0      False
1      False
2      False
3      False
4      False
       ...
845    False
846    False
847    False
848    False
849    False
Name: fare, Length: 850, dtype: bool

In [ ]:
# to see fare is greater than 70 or not put above condition in dataframe(data)

data_gt_70 = data[data['fare'] > 70]

print(data_gt_70)

    passenger_id  pclass                                               name  \
10           313       1                          Widener, Mr. Harry Elkins
11            43       1    Bucknell, Mrs. William Robert (Emma Eliza Ward)
12           233       1      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)
37           249       1                        Ryerson, Master. John Borie
42           275       1  Spedden, Mrs. Frederic Oakley (Margaretta Corn...

       sex   age  sibsp  parch    ticket      fare            cabin embarked  \
10    male  27.0      0      2    113503  211.5000              C82        C
11  female  60.0      0      0     11813   76.2917              D15        C
12  female  56.0      0      1     11767   83.1583              C50        C
37    male  13.0      2      2  PC 17608  262.3750  B57 B59 B63 B66        C
42  female  40.0      1      1     16966  134.5000              E34        C

   boat  body                        home.dest  survived
10  NaN   NaN                  Elkins Park, PA         0
11    8   NaN                 Philadelphia, PA         1
12    7   NaN        Mt Airy, Philadelphia, PA         1
37    4   NaN  Haverford, PA / Cooperstown, NY         1
42    3   NaN                  Tuxedo Park, NY         1

In [ ]:
 # filter for rows where gender is female
females = data[data['sex'] == 'female']
print(females)

     passenger_id  pclass                                               name  \
0            1216       3                                 Smyth, Miss. Julia
2            1267       3  Van Impe, Mrs. Jean Baptiste (Rosalie Paula Go...
3             449       2              Hocking, Mrs. Elizabeth (Eliza Needs)
7             560       2                              Sinkkonen, Miss. Anna
8            1079       3                                 Ohman, Miss. Velin
..            ...     ...                                                ...
838           333       2                            Ball, Mrs. (Ada E Hall)
841           208       1    Minahan, Mrs. William Edward (Lillian E Thorpe)
842           709       3                          Carr, Miss. Helen "Ellen"
847           467       2                Kantor, Mrs. Sinai (Miriam Sternin)
848          1112       3                          Peacock, Miss. Treasteall

        sex   age  sibsp  parch              ticket     fare cabin embarked  \
0    female   NaN      0      0              335432   7.7333   NaN        Q
2    female  30.0      1      1              345773  24.1500   NaN        S
3    female  54.0      1      3               29105  23.0000   NaN        S
7    female  30.0      0      0              250648  13.0000   NaN        S
8    female  22.0      0      0              347085   7.7750   NaN        S
..      ...   ...    ...    ...                 ...      ...   ...      ...
838  female  36.0      0      0               28551  13.0000     D        S
841  female  37.0      1      0               19928  90.0000   C78        Q
842  female  16.0      0      0              367231   7.7500   NaN        Q
847  female  24.0      1      0              244367  26.0000   NaN        S
848  female   3.0      1      1  SOTON/O.Q. 3101315  13.7750   NaN        S

    boat  body                          home.dest  survived
0     13   NaN                                NaN         1
2    NaN   NaN                                NaN         0
3      4   NaN               Cornwall / Akron, OH         1
7     10   NaN           Finland / Washington, DC         1
8      C   NaN                                NaN         1
..   ...   ...                                ...       ...
838   10   NaN   Bristol, Avon / Jacksonville, FL         1
841   14   NaN                    Fond du Lac, WI         1
842   16   NaN  Co Longford, Ireland New York, NY         1
847   12   NaN                 Moscow / Bronx, NY         1
848  NaN   NaN                                NaN         0

[299 rows x 15 columns]

In [ ]:
#  for two condition we use & operator

females_sur = data[(data['sex'] == 'female') & (data['survived'] == 1)]
females_sur

,passenger_id,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,survived
0,1216,3,"Smyth, Miss. Julia",female,NaN,0,0,335432,7.7333,NaN,Q,13,NaN,NaN,1
3,449,2,"Hocking, Mrs. Elizabeth (Eliza Needs)",female,54.0,1,3,29105,23.0000,NaN,S,4,NaN,"Cornwall / Akron, OH",1
7,560,2,"Sinkkonen, Miss. Anna",female,30.0,0,0,250648,13.0000,NaN,S,10,NaN,"Finland / Washington, DC",1
8,1079,3,"Ohman, Miss. Velin",female,22.0,0,0,347085,7.7750,NaN,S,C,NaN,NaN,1
11,43,1,"Bucknell, Mrs. William Robert (Emma Eliza Ward)",female,60.0,0,0,11813,76.2917,D15,C,8,NaN,"Philadelphia, PA",1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
837,102,1,"Earnshaw, Mrs. Boulton (Olive Potter)",female,23.0,0,1,11767,83.1583,C54,C,7,NaN,"Mt Airy, Philadelphia, PA",1
838,333,2,"Ball, Mrs. (Ada E Hall)",female,36.0,0,0,28551,13.0000,D,S,10,NaN,"Bristol, Avon / Jacksonville, FL",1
841,208,1,"Minahan, Mrs. William Edward (Lillian E Thorpe)",female,37.0,1,0,19928,90.0000,C78,Q,14,NaN,"Fond du Lac, WI",1
842,709,3,"Carr, Miss. Helen ""Ellen""",female,16.0,0,0,367231,7.7500,NaN,Q,16,NaN,"Co Longford, Ireland New York, NY",1
847,467,2,"Kantor, Mrs. Sinai (Miriam Sternin)",female,24.0,1,0,244367,26.0000,NaN,S,12,NaN,"Moscow / Bronx, NY",1

In [ ]:
# we can merge two columns into a single new column

data['family'] = data['sibsp'] + data['parch']

print(data.head())

   passenger_id  pclass                                               name  \
0          1216       3                                 Smyth, Miss. Julia
1           699       3                                    Cacic, Mr. Luka
2          1267       3  Van Impe, Mrs. Jean Baptiste (Rosalie Paula Go...
3           449       2              Hocking, Mrs. Elizabeth (Eliza Needs)
4           576       2                                    Veal, Mr. James

      sex   age  sibsp  parch  ticket     fare cabin embarked boat  body  \
0  female   NaN      0      0  335432   7.7333   NaN        Q   13   NaN
1    male  38.0      0      0  315089   8.6625   NaN        S  NaN   NaN
2  female  30.0      1      1  345773  24.1500   NaN        S  NaN   NaN
3  female  54.0      1      3   29105  23.0000   NaN        S    4   NaN
4    male  40.0      0      0   28221  13.0000   NaN        S  NaN   NaN

                  home.dest  survived  family
0                       NaN         1       0
1                   Croatia         0       0
2                       NaN         0       2
3      Cornwall / Akron, OH         1       4
4  Barre, Co Washington, VT         0       0

**Summary Statistics**

In [ ]:
# average age of the Titanic passengers
data['age'].mean()

29.519847189349115

In [ ]:
# Median age and fare of the Titanic passengers

median = data[['age', 'fare']].median()
print(median)

age     28.0000
fare    14.1083
dtype: float64

In [ ]:

# Similarly The .agg() method allows you to apply your own custom functions to a DataFrame, 
#as well as apply functions to more than one column of a DataFrame at once, 
#making your aggregations super-efficient.
     
data[['age', 'fare']].agg(['min','max','median','mean'])

              age        fare
min      0.166700    0.000000
max     80.000000  512.329200
median  28.000000   14.108300
mean    29.519847   34.012701

In [ ]:
# Print the maximum of the date column
print(data[["age", "fare"]].max())

# Print the minimum of the date column
print(data[["age", "fare"]].min())

age      80.0000
fare    512.3292
dtype: float64
age     0.1667
fare    0.0000
dtype: float64

**Slicing and Indexing**

In [ ]:
a = ['spam', 'egg', 'bacon', 'tomato', 'ham', 'lobster']

In [ ]:
a[0]

'spam'

In [ ]:
a[-1]

'lobster'

In [ ]:
len(a)

6

In [ ]:
a[len(a)]   # Index start from zero

IndexError: ignored

In [ ]:
a[len(a)-1]

'lobster'

In [ ]:
a[-6]

'spam'

**Slicing**

In [ ]:
a[2:5]

['bacon', 'tomato', 'ham']

In [ ]:
a[-2:-5]

# how to get same output with positive index?

a[1:4]

['egg', 'bacon', 'tomato']

In [ ]:
a[:4]

['spam', 'egg', 'bacon', 'tomato']

In [ ]:
a[2:]

['bacon', 'tomato', 'ham', 'lobster']

In [ ]:

a[2:len(a)]

['bacon', 'tomato', 'ham', 'lobster']

In [ ]:
a[:]

['spam', 'egg', 'bacon', 'tomato', 'ham', 'lobster']

In [ ]:

a[0:4]

['spam', 'egg', 'bacon', 'tomato']

**Stride**

In [ ]:

a

['spam', 'egg', 'bacon', 'tomato', 'ham', 'lobster']

In [ ]:
a[0:len(a):2]

['spam', 'bacon', 'ham']

In [ ]:
a[6:0:-2]

['lobster', 'tomato', 'egg']

In [ ]:

a[::-1]    # reverse the list

['lobster', 'ham', 'tomato', 'bacon', 'egg', 'spam']

**Native accessors:** Native python objects provide good ways of indexing data

In [ ]:
data.pclass

0      3
1      3
2      3
3      2
4      2
      ..
845    1
846    1
847    2
848    3
849    2
Name: pclass, Length: 850, dtype: int64

In [ ]:
data['pclass']

0      3
1      3
2      3
3      2
4      2
      ..
845    1
846    1
847    2
848    3
849    2
Name: pclass, Length: 850, dtype: int64